org/articles/notetaking.org
#+TITLE: Notetaking

* A Notetaking Baseline for Academic Work

People online have various ideas on what devices and techniques constitute good notetaking. I am someone who reads and takes notes a fairly substantial amount every day, and whose livelihood is largely contingent on that process being fairly effective. However, none of these systems ever really stuck with me. It has been my experience that the only determining factor that really matters is whether I was paying attention while I was reading, and whether I regularly think about what I read after I read it. This is potentially troublesome to people attempting to sell you effective notetaking strategies.

What follows is my attempt at organizing notetaking into a system that (hopefully) has the following properties:

1. enables me to learn topics really, really well.
2. doesn't require a very tedious, unneeded components which discourage me from doing it
3. /unifies/ my /knowledge management/ -- largely invisibly connects things together for me
4. lets me evaluate if the newest shiny bauble is useful or would damage my process

** Remark: AI Cannot Learn For You

Many people have taken swings at incorporating LLMs into the notetaking process and for the most part all of these attempts have been pretty bad. The reason for this is very simple, and nicely illustrates the entire point of this post. Learning something new involves two fundamental steps: *exposure* and *encoding*, and any software-enabled notetaking system must absolutely, never, ever touch either of these two things. We are going to try to design a system which uses technology to help us learn, understand, and remember; but we need first to establish some baselines for what's kosher and what's harmful.

*** Exposure

The way to learn new things is to read. You /have/ to read. There are some things which loosely "count" as reading, like paying attention to lectures/videos, being tutored by someone, etc. But for the most part, there's rarely anything better than being exposed to an extremely dense block of information, organized with the intent to build understanding. If you do anything even vaguely academic for work, you should be reading pretty much all the time. 

Consider the common naive idea of using chatGPT to create flashcards from a textbook chapter you have read. On the surface this seems like a really great idea: we can even use cloze cards to directly rip out sentences and mask important key words to reduce the likelihood of llm hallucination. However, the big problem with this is that the language model does not actually have access to your internal body of knowledge, and cannot create cards that are the appropriate difficulty for you. For example, I recently read the [[https://arxiv.org/abs/2405.15793][SWE-Agent]] paper and tried to run this as an experiment[fn:3]. Example cards that this generated for me are below

#+BEGIN_QUOTE
{{c1::SWE-agent}} is an autonomous system that uses a {{c2::language model}} to interact with a computer to solve {{c3::software engineering tasks}}.

{{c1::SWE-agent}} uses an {{c2::ACI}} that enables an {{c3::LM}} to act as a {{c4::software engineering agent}}.
#+END_QUOTE

Which are, you know, fine. If I didn't already have some background in LLMs then maybe I could use some flashcards to tell me that SWE-agent is an LLM agent for software engineering. But this illustrates part of the problem: the things I want to remember in this paper are very specifically what its contents are compared to other papers, and what new concepts are introduced in this paper that I do not already know. In order to obtain this information *I need to read the paper* and then subsequently *I need to identify things I do not already know*.

The LLM cannot see inside my brain. If it did, it could read the paper for me and pull out specifically the concepts which I need to make flashcards for, and then make those for me. But here in actual current reality there is a necessary exposure to the concepts which I need to actually do myself. 

*** Encoding

Longtime readers know I have a passing interest in [[https://planetbanatt.net/articles/memory.html][memory sports]]. It was through a brief stint in memory sports where I really learned that /seeing something/ and /putting something in my memory/ are two separate processes, and the second one is a deliberate and active process.

The LLM flashcards app idea falls short in this second way, as well. People commonly tell you when using [[https://planetbanatt.net/articles/anki.html][flashcard systems]] that you're usually better off making your own cards, and this is a big part of why: making the card is a step where you are /actively putting/ this information into your memory. Letting a machine handle this step will rob you of a critical step in the process, which I have found usually defers this step to the first time you see the card[fn:1].

** Physically Taking the Notes

paper vs computer
https://journals.sagepub.com/doi/abs/10.1177/0956797614524581 
https://journals.sagepub.com/doi/10.1177/0956797620965541?icid=int.sj-abstract.similar-articles.3

I am greedy, so let's figure out a way to do everything.

