articles/notetaking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-23 Wed 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notetaking</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">Notetaking</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8ed506d">A Notetaking Baseline for Academic Work</a>
<ul>
<li><a href="#org8d394cb">Remark: AI Cannot Learn For You</a>
<ul>
<li><a href="#org0e52d79">Exposure</a></li>
<li><a href="#org998cdda">Encoding</a></li>
</ul>
</li>
<li><a href="#orgc7a4543">Physically Taking the Notes</a>
<ul>
<li><a href="#orgd50c2a9">Writing on A4 Paper</a>
<ul>
<li><a href="#orgc905605">Remark: Nice Stationary is the Mind Killer</a></li>
<li><a href="#org3c69c48">Formatting Notes</a>
<ul>
<li><a href="#orgde74504">always title at top of first page</a></li>
<li><a href="#orgf5867d2">Box -&gt; anki flashcard</a></li>
<li><a href="#org9e24a71">always tl;dr at the bottom of the last page</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org78fa44c">Typing</a></li>
<li><a href="#orgb26dc6b">Yapping</a></li>
</ul>
</li>
<li><a href="#org1397491">Pipelining</a>
<ul>
<li><a href="#orgdcc25e2">Digitizing Written Notes with Multimodal LLMs</a></li>
</ul>
</li>
<li><a href="#org3adc66e">Comparison to "Study Devices"</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8ed506d" class="outline-1">
<h1 id="org8ed506d">A Notetaking Baseline for Academic Work</h1>
<div class="outline-text-1" id="text-org8ed506d">
<p>
People online have various ideas on what devices and techniques constitute good notetaking. I am someone who reads and takes notes a fairly substantial amount every day, and whose livelihood is largely contingent on that process being fairly effective. However, none of these systems ever really stuck with me. It has been my experience that the only determining factor that really matters is whether I was paying attention while I was reading, and whether I regularly think about what I read after I read it. This is potentially troublesome to people attempting to sell you effective notetaking strategies.
</p>

<p>
What follows is my attempt at organizing notetaking into a system that (hopefully) has the following properties:
</p>

<ol class="org-ol">
<li>enables me to learn topics really, really well.</li>
<li>doesn't require a very tedious, unneeded components which discourage me from doing it</li>
<li><i>unifies</i> my <i>knowledge management</i> &#x2013; largely invisibly connects things together for me</li>
<li>lets me evaluate if the newest shiny bauble is useful or would damage my process</li>
</ol>
</div>

<div id="outline-container-org8d394cb" class="outline-2">
<h2 id="org8d394cb">Remark: AI Cannot Learn For You</h2>
<div class="outline-text-2" id="text-org8d394cb">
<p>
Many people have taken swings at incorporating LLMs into the notetaking process and for the most part all of these attempts have been pretty bad. The reason for this is very simple, and nicely illustrates the entire point of this post. Learning something new involves two fundamental steps: <b>exposure</b> and <b>encoding</b>, and any software-enabled notetaking system must absolutely, never, ever touch either of these two things. We are going to try to design a system which uses technology to help us learn, understand, and remember; but we need first to establish some baselines for what's kosher and what's harmful.
</p>
</div>

<div id="outline-container-org0e52d79" class="outline-3">
<h3 id="org0e52d79">Exposure</h3>
<div class="outline-text-3" id="text-org0e52d79">
<p>
The way to learn new things is to read. You <i>have</i> to read. There are some things which loosely "count" as reading, like paying attention to lectures/videos, being tutored by someone, etc. But for the most part, there's rarely anything better than being exposed to an extremely dense block of information, organized with the intent to build understanding. If you do anything even vaguely academic for work, you should be reading pretty much all the time. 
</p>

<p>
Consider the common naive idea of using chatGPT to create flashcards from a textbook chapter you have read. On the surface this seems like a really great idea: we can even use cloze cards to directly rip out sentences and mask important key words to reduce the likelihood of llm hallucination. However, the big problem with this is that the language model does not actually have access to your internal body of knowledge, and cannot create cards that are the appropriate difficulty for you. For example, I recently read the <a href="https://arxiv.org/abs/2405.15793">SWE-Agent</a> paper and tried to run this as an experiment<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. Example cards that this generated for me are below
</p>

<blockquote>
<p>
{{c1::SWE-agent}} is an autonomous system that uses a {{c2::language model}} to interact with a computer to solve {{c3::software engineering tasks}}.
</p>

<p>
{{c1::SWE-agent}} uses an {{c2::ACI}} that enables an {{c3::LM}} to act as a {{c4::software engineering agent}}.
</p>
</blockquote>

<p>
Which are, you know, fine. If I didn't already have some background in LLMs then maybe I could use some flashcards to tell me that SWE-agent is an LLM agent for software engineering. But this illustrates part of the problem: the things I want to remember in this paper are very specifically what its contents are compared to other papers, and what new concepts are introduced in this paper that I do not already know. In order to obtain this information <b>I need to read the paper</b> and then subsequently <b>I need to identify things I do not already know</b>.
</p>

<p>
The LLM cannot see inside my brain. If it did, it could read the paper for me and pull out specifically the concepts which I need to make flashcards for, and then make those for me. But here in actual current reality there is a necessary exposure to the concepts which I need to actually do myself. 
</p>
</div>
</div>

<div id="outline-container-org998cdda" class="outline-3">
<h3 id="org998cdda">Encoding</h3>
<div class="outline-text-3" id="text-org998cdda">
<p>
Longtime readers know I have a passing interest in <a href="https://planetbanatt.net/articles/memory.html">memory sports</a>. It was through a brief stint in memory sports where I really learned that <i>seeing something</i> and <i>putting something in my memory</i> are two separate processes, and the second one is a deliberate and active process.
</p>

<p>
The LLM flashcards app idea falls short in this second way, as well. People commonly tell you when using <a href="https://planetbanatt.net/articles/anki.html">flashcard systems</a> that you're usually better off making your own cards, and this is a big part of why: making the card is a step where you are <i>actively putting</i> this information into your memory. Letting a machine handle this step will rob you of a critical step in the process, which I have found usually defers this step to the first time you see the card<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc7a4543" class="outline-2">
<h2 id="orgc7a4543">Physically Taking the Notes</h2>
<div class="outline-text-2" id="text-orgc7a4543">
<p>
paper vs computer
<a href="https://journals.sagepub.com/doi/abs/10.1177/0956797614524581">https://journals.sagepub.com/doi/abs/10.1177/0956797614524581</a> 
<a href="https://journals.sagepub.com/doi/10.1177/0956797620965541?icid=int.sj-abstract.similar-articles.3">https://journals.sagepub.com/doi/10.1177/0956797620965541?icid=int.sj-abstract.similar-articles.3</a>
</p>

<p>
I am greedy, so let's figure out a way to do everything.
</p>
</div>
