articles/notetaking.html

<div id="outline-container-orgd50c2a9" class="outline-3">
<h3 id="orgd50c2a9">Writing on A4 Paper</h3>
<div class="outline-text-3" id="text-orgd50c2a9">
<p>
new thing I'm trying
</p>

<p>
<a href="https://www.amazon.com/LAMY-Color-Ballpoint-Brushed-L401/dp/B000UTKMDQ/ref=sr_1_1?crid=3VCHUTF8J2OZ2&amp;dib=eyJ2IjoiMSJ9.AIpczuQX9COcBrJ6-rJreuf1r6d4pEUzDPyZPEqQe4aKBWUM-Vr44toBcgNSxa3_bL3hsR25APyHZOwQYI3SxPHJtVz-61nggVUu901voXpZma8HyDPRmMkz0bUQpeSf591sSv-Wwi1x2QKYqrYtK9WqVHS2KxvDIrHU6bZgmq1omT8s-KL4HkTqDxv9EnqrYOgMujXHI66vyYpNC7fKlPUcA_khkn0CeMJnO8OWmYCAM0z6erUmntWkVszJm3ZtBDF_g1Ke2BP8ityHK_QOE1jqi07L98KM1C2O0kWo1j8.nP2ou6FzJmf4t2EPbk4VQXFGXz3-rXrRNNNtY2bze6g&amp;dib_tag=se&amp;keywords=Lamy%2B2000%2BMultipen&amp;qid=1718857367&amp;s=office-products&amp;sprefix=lamy%2B2000%2Bmultipen%2Coffice-products%2C134&amp;sr=1-1&amp;th=1">pen</a> <a href="https://www.amazon.com/Lamy-logo-3-colours-multicoloured-ballpoint/dp/B002KK5YDQ/ref=cs_sr_dp_2?crid=YNUSZCI2NE00&amp;dib=eyJ2IjoiMSJ9.ftVK5OPW-TgvQqD1g38rJeB-lwqaJYf1XjDx_twBuzBxaEa-jDcQ6kP1VsGJ6kr4PIcXpiqH7Gi6ffBIyBXyE0GDT0-RPbbD0DAJ5S3l2jHZyMznDaKWKncwnZwI9ti2GAT29grDsvSUgct8ibQz8FE_LnT85qT3KIA82eeEMNJmawt-6v6qjuTYEKX3xa5GfTsMZbbb1Tvc-DhS9bx77aKSU2GeP7nYfG-M8_dP3RI-wFDAV-jU_lMqMQ2MjaYXFs8dXvmP-Xa--OQX88W0JVjqi07L98KM1C2O0kWo1j8.8hGNvkAICkenlcqu1HpYhOngdeEprvypj4E8fdBZHdQ&amp;dib_tag=se&amp;keywords=lamy%2Blogo%2B3%2Bpen&amp;qid=1718942889&amp;sprefix=lamy%2Blogo%2B3%2Bpen%2Caps%2C144&amp;sr=8-2&amp;th=1">diff pen</a> <a href="https://www.amazon.com/Stream-Prime-Ballpoint-colors-SXE3330005-24/dp/B08WX1KGKP/ref=sr_1_1?crid=2D99YYKYWIQTF&amp;dib=eyJ2IjoiMSJ9.oA5EO4x-sCohV9uzc1HLK3C6cDtcA1hqwD-aUD76Zqz2qBkGuHATotaRekM-CEwDOwrvEaIL-SRlJOV0ldY2DS-kA2nOjHzpweUANsl2W5KQldZSLEB29BSUNjVVzEm51ArkYnTbrBwPlMeCi0wcCiqdGb2xnFv77iZqUJ8rHLyZ83u3O05VCZhmzwV0TvbmFHbi4AOCeSLjHMww2mVSCEtctIa5w-YJGa53zRaEmIkIontj8tIlGwNbopNkZIUN8xhMSrP-lviarvmyKU4MF6yCWrR3Ngap4muwju_LT4I.B0w0Wh-QHcVkUk3c-0EzWx00eWqJzx-OgS5cZNN6UFc&amp;dib_tag=se&amp;keywords=Uniball%2BJetstream%2BPrime&amp;qid=1718943067&amp;sprefix=uniball%2Bjetstream%2Bprime%2Caps%2C142&amp;sr=8-1&amp;th=1">less luxury pen</a>
<a href="https://www.amazon.com/Hammermill-Paper-letter-Bright-Sheets/dp/B01MTJEHYA/ref=sr_1_2?crid=1IK57K0OJX7JN&amp;dib=eyJ2IjoiMSJ9.BGp6pdQoiuBqqYAtiCHQxIBtE9uZQxWBbIn_2nekYn1sb3cEggE4yCM7PE4tl7MR81rvYQZ6phk7I6i6lP2wVL1tT8OAKBMOPOv12OZ_bx-t8XjOzTDyW0HYl3U--e5BGhBT_R4-4r-IIPMgLI03SNwnMB5BrcyFGQFGdlv47J_vC4eOpYQAiLQiuCIY-r0yHst-qIN8ruuPquaoJnafFhCrVr3Me7g7LDJDbT_0jaoLgbGSw4xp23sHohy9XZbsDWYCRsQAZDnzm9nCkJQUe3XiuVcvWHeJh-HqIqD8_W8.TsByK5ZCYAl2i09jyHOV1GSSURLNDbL-5Isbsylnx6Q&amp;dib_tag=se&amp;keywords=a4%2Bpaper&amp;qid=1718857903&amp;sprefix=a4%2Bpaper%2Caps%2C158&amp;sr=8-2&amp;th=1">paper</a>
<a href="https://www.amazon.com/ProCase-Clipboard-Portfolio-Professional-Conference/dp/B0CHRTS4XM/ref=sr_1_8?crid=15CMK17DKKHA6&amp;dib=eyJ2IjoiMSJ9.YdZKOKLGRUeW01KnygpE9AUvYbvWZyXG44eJqn9V0_wQN7O-KxLAHQ93YR732xyjnAm9vnxVg5N9Ggf6-Val2QZAOHgmYp4__t1tQQOs6-M_K_VL1ZO0UH-VdopZHc57mjMyYKktHMemkkewNAG1cGFHUfzW-VSN9JgSSvxex1IrP6xqfD6g6xcn-FQcozrjTrILKvnDT7N_CEcHwJCOiBiFjSrpkKc055EBnw_f2CE5lYYTwrYW-SxfwtmuuMpRHffvdl2IMdS9f2DSIyFNr9QZmiHsrrkdOBTU_FV4Vvw.TN9FD2__YnoXvf9_reyvVuMwiJ5vg17nJhn1qEBWX7I&amp;dib_tag=se&amp;keywords=folder%2Bclipboard&amp;qid=1718857927&amp;sprefix=folder%2Bclipboard%2Caps%2C144&amp;sr=8-8&amp;th=1">clipcase thing</a>
</p>
</div>

<div id="outline-container-orgc905605" class="outline-4">
<h4 id="orgc905605">Remark: Nice Stationary is the Mind Killer</h4>
<div class="outline-text-4" id="text-orgc905605">
<p>
I am a sucker for nice notebooks and stuff. I always buy them and think that I am going to spend all my time filling them with beautiful thoughts that I can go back through later and enjoy reading. This presents a problem &#x2013; I don't want to use the stationary unless my thoughts are beautiful and interesting. Notes are best taken when they are about something you are clueless about. They represent the stage of learning where you are at your dumbest possible with respect to understanding a topic, and the entire purpose of them is to destroy the lack of understanding.
</p>

<p>
"Scratch Paper" on the other hand, is perfect for notes. You just write on it, as ugly as possible, to dump your thoughts and perform some act of active encoding and compression. You should be so comfortable with this that it would seem normal enough to destroy these notes later due to being not useful anymore. Stuff should be crossed out, stuff should be wrong; it ought to be chaotic and messy as you fight through understanding something new.
</p>

<p>
What needs to be beautiful is the <i>synthesis</i> of what you are learning with what you already know. Beautiful notes are a strange concept to me: anything sufficiently beautiful seems to lack the prerequisite struggle to warrant notes being taken on the topic in the first place.
</p>
</div>
</div>

<div id="outline-container-org3c69c48" class="outline-4">
<h4 id="org3c69c48">Formatting Notes</h4>
<div class="outline-text-4" id="text-org3c69c48">
</div>
<div id="outline-container-orgde74504" class="outline-5">
<h5 id="orgde74504">always title at top of first page</h5>
</div>

<div id="outline-container-orgf5867d2" class="outline-5">
<h5 id="orgf5867d2">Box -&gt; anki flashcard</h5>
</div>

<div id="outline-container-org9e24a71" class="outline-5">
<h5 id="org9e24a71">always tl;dr at the bottom of the last page</h5>
</div>
</div>
</div>

<div id="outline-container-org78fa44c" class="outline-3">
<h3 id="org78fa44c">Typing</h3>
<div class="outline-text-3" id="text-org78fa44c">
<p>
org-mode is really useful for people who produce lots of words
</p>
</div>
</div>

<div id="outline-container-orgb26dc6b" class="outline-3">
<h3 id="orgb26dc6b">Yapping</h3>
<div class="outline-text-3" id="text-orgb26dc6b">
<p>
Blogposts in my experience are really good.
</p>
</div>
</div>
</div>

<div id="outline-container-org1397491" class="outline-2">
<h2 id="org1397491">Pipelining</h2>
<div class="outline-text-2" id="text-org1397491">
<p>
Where LLMs <i>can</i> be useful for a notetaking system is <i>connecting components together</i>. 
</p>
</div>

<div id="outline-container-orgdcc25e2" class="outline-3">
<h3 id="orgdcc25e2">Digitizing Written Notes with Multimodal LLMs</h3>
<div class="outline-text-3" id="text-orgdcc25e2">
<p>
The reason I took such care to include the anki and tldr stuff is because we are going to pipe this into an LLM to turn it to text.
</p>

<p>
Specifically, we input a bundle of all the pictures in order, and we ask it to do five things:
</p>

<ol class="org-ol">
<li>In notes file, we add a new header with the title at the top of the first page<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></li>
<li>Under that header, we add the tl;dr from the bottom of the last page</li>
<li>Under that tldr, we add a csv block with our anki cards (and send that to anki)</li>
<li>Digitize the notes to be like I drew them on a computer</li>
<li>OCR the notes into a txt file for searching purposes</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org3adc66e" class="outline-2">
<h2 id="org3adc66e">Comparison to "Study Devices"</h2>
<div class="outline-text-2" id="text-org3adc66e">
<p>
The above represents a minimum bar for me to consider using a tool which claims to want to insert itself into my process of study. e-ink devices, for example, often have clunky notetaking capabilities that claim to hold everything together for you in a way that makes it valuable somehow.
</p>
</div>
</div>
</div>
