org/articles/notetaking.org
* Footnotes

[fn:3] Prompt:

Attached is a pdf I am reading. I would like you to help me make flashcards to study for a test.

I would like the following:

1. Create an outline of the pdf provided which captures all of the major details. This should be in bullet-point format, and should allow me to skim through it and immediately remember the general contents of the pdf (e.g. for a research paper, do not say intro, related work, experiments, results, discussion, conclusion, etc; instead each section should be like "Experiment: adding l2 regularization to loss function" etc).
2. For each of these sections, pull out a subset of sentences which represent a detailed overview of that section. This should contain each "atomic" unit of information, as defined by Pitor Wozniak's 20 rules of knowledge formulation. Basically: each of these sentences should contain all of the "new facts" contained in that section, which I am unlikely to already know.
3. Make anki cloze deletion cards from these sentences. Do this by wrapping specific important words or phrases in curly braces. For example, for the sentence "The capital of Burkina Faso is Ouagadougou" can be turned into two cards like so: "The capital of {{c1::Burkina Faso}} is {{c2::Ouagadougou}}" where c1 will obscure Burkina Faso and c2 will obscure Ouagadougou.

Please note that I am specifically interested in being assisted with the rote memory component of studying for this test. I have faith that I could answer how/why/conceptual questions on this topic, but that isn't well suited for flashcards which are specifically just drilling my rote memorization. As such, try to avoid "conceptual cards" which are easy to guess or intuit by understanding -- each cloze deletion should be a concept that I should get wrong with maximum probability if I did not memorize the topic in sufficiently high resolution. 

Aim to let me recall the technical and historical details of this pdf with roughly perfect precision.

[fn:2] Also put the date here

[fn:1] I have written some scripts which will use llms to make cloze cards based on my clipboard contents if I press a hotkey, and I've found that I'll often want to go in and edit new cards the first time I see them anyways, which sort of defeats the purpose. 
