articles/notetaking.html
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Prompt:
</p>

<p class="footpara">
Attached is a pdf I am reading. I would like you to help me make flashcards to study for a test.
</p>

<p class="footpara">
I would like the following:
</p>

<ol class="org-ol">
<li>Create an outline of the pdf provided which captures all of the major details. This should be in bullet-point format, and should allow me to skim through it and immediately remember the general contents of the pdf (e.g. for a research paper, do not say intro, related work, experiments, results, discussion, conclusion, etc; instead each section should be like "Experiment: adding l2 regularization to loss function" etc).</li>
<li>For each of these sections, pull out a subset of sentences which represent a detailed overview of that section. This should contain each "atomic" unit of information, as defined by Pitor Wozniak's 20 rules of knowledge formulation. Basically: each of these sentences should contain all of the "new facts" contained in that section, which I am unlikely to already know.</li>
<li>Make anki cloze deletion cards from these sentences. Do this by wrapping specific important words or phrases in curly braces. For example, for the sentence "The capital of Burkina Faso is Ouagadougou" can be turned into two cards like so: "The capital of {{c1::Burkina Faso}} is {{c2::Ouagadougou}}" where c1 will obscure Burkina Faso and c2 will obscure Ouagadougou.</li>
</ol>

<p class="footpara">
Please note that I am specifically interested in being assisted with the rote memory component of studying for this test. I have faith that I could answer how/why/conceptual questions on this topic, but that isn't well suited for flashcards which are specifically just drilling my rote memorization. As such, try to avoid "conceptual cards" which are easy to guess or intuit by understanding &#x2013; each cloze deletion should be a concept that I should get wrong with maximum probability if I did not memorize the topic in sufficiently high resolution. 
</p>

<p class="footpara">
Aim to let me recall the technical and historical details of this pdf with roughly perfect precision.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I have written some scripts which will use llms to make cloze cards based on my clipboard contents if I press a hotkey, and I've found that I'll often want to go in and edit new cards the first time I see them anyways, which sort of defeats the purpose. 
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Also put the date here
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
